Revit 2027 API
Document.OwnerFamily Property
Get the Family of this Family Document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Family OwnerFamily { get; }
Public ReadOnly Property OwnerFamily As Family
	Get
public:
property Family^ OwnerFamily {
	Family^ get ();
}
member OwnerFamily : Family with get
Property Value
Family
Remarks
 Only available if the current document is family document.
Example
string categoryName = familyDoc.OwnerFamily.FamilyCategory.Name;
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace